app/Controllers/api.php

SELECT *
FROM `province`
ORDER BY `id` DESC
---
    public function index()
    {
        $model = new provinceModel();
        $data['province'] = $model->orderBy('id', 'DESC')->findAll();

INSERT INTO `province` (`kota`, `provinsi`) VALUES ('sumedang', 'jawa barat')
---
    public function create()
    {
        $model = new provinceModel();
        $data = [
            'kota' => $this->request->getVar('kota'),
            'provinsi'  => $this->request->getVar('provinsi'),
        ];
        $model->insert($data);